#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

// /////////////////////////////////////////////////////////////
// Binary: client.dll
// Classes count: 414 (Allocated) | 443 (Unallocated)
// Enums count: 1 (Allocated) | 8 (Unallocated)
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

// Registered binary: client.dll (project 'client')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class C_BaseCombatCharacter__WaterWakeMode_t : uint32_t
{
	WATER_WAKE_NONE = 0x0,
	WATER_WAKE_IDLE = 0x1,
	WATER_WAKE_WALKING = 0x2,
	WATER_WAKE_RUNNING = 0x3,
	WATER_WAKE_WATER_OVERHEAD = 0x4,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 15
// Alignment: 4
// Size: 0x4
enum class CompositeMaterialInputLooseVariableType_t : uint32_t
{
	// MPropertyFriendlyName "Boolean"
	LOOSE_VARIABLE_TYPE_BOOLEAN = 0x0,
	// MPropertyFriendlyName "Integer"
	LOOSE_VARIABLE_TYPE_INTEGER1 = 0x1,
	// MPropertyFriendlyName "Integer2"
	LOOSE_VARIABLE_TYPE_INTEGER2 = 0x2,
	// MPropertyFriendlyName "Integer3"
	LOOSE_VARIABLE_TYPE_INTEGER3 = 0x3,
	// MPropertyFriendlyName "Integer4"
	LOOSE_VARIABLE_TYPE_INTEGER4 = 0x4,
	// MPropertyFriendlyName "Float"
	LOOSE_VARIABLE_TYPE_FLOAT1 = 0x5,
	// MPropertyFriendlyName "Float2"
	LOOSE_VARIABLE_TYPE_FLOAT2 = 0x6,
	// MPropertyFriendlyName "Float3"
	LOOSE_VARIABLE_TYPE_FLOAT3 = 0x7,
	// MPropertyFriendlyName "Float4"
	LOOSE_VARIABLE_TYPE_FLOAT4 = 0x8,
	// MPropertyFriendlyName "Color4"
	LOOSE_VARIABLE_TYPE_COLOR4 = 0x9,
	// MPropertyFriendlyName "String"
	LOOSE_VARIABLE_TYPE_STRING = 0xa,
	// MPropertyFriendlyName "System Variable"
	LOOSE_VARIABLE_TYPE_SYSTEMVAR = 0xb,
	// MPropertyFriendlyName "Material"
	LOOSE_VARIABLE_TYPE_RESOURCE_MATERIAL = 0xc,
	// MPropertyFriendlyName "Texture"
	LOOSE_VARIABLE_TYPE_RESOURCE_TEXTURE = 0xd,
	// MPropertyFriendlyName "Panorama Render"
	LOOSE_VARIABLE_TYPE_PANORAMA_RENDER = 0xe,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 7
// Alignment: 4
// Size: 0x4
enum class CompositeMaterialInputTextureType_t : uint32_t
{
	// MPropertyFriendlyName "Default"
	INPUT_TEXTURE_TYPE_DEFAULT = 0x0,
	// MPropertyFriendlyName "Normal Map"
	INPUT_TEXTURE_TYPE_NORMALMAP = 0x1,
	// MPropertyFriendlyName "Color"
	INPUT_TEXTURE_TYPE_COLOR = 0x2,
	// MPropertyFriendlyName "Masks"
	INPUT_TEXTURE_TYPE_MASKS = 0x3,
	// MPropertyFriendlyName "Roughness"
	INPUT_TEXTURE_TYPE_ROUGHNESS = 0x4,
	// MPropertyFriendlyName "Pearlescence Mask"
	INPUT_TEXTURE_TYPE_PEARLESCENCE_MASK = 0x5,
	// MPropertyFriendlyName "Ambient Occlusion"
	INPUT_TEXTURE_TYPE_AO = 0x6,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 6
// Alignment: 4
// Size: 0x4
enum class CompositeMaterialInputContainerSourceType_t : uint32_t
{
	// MPropertyFriendlyName "Target Material"
	CONTAINER_SOURCE_TYPE_TARGET_MATERIAL = 0x0,
	// MPropertyFriendlyName "Material from Target Material Attr"
	CONTAINER_SOURCE_TYPE_MATERIAL_FROM_TARGET_ATTR = 0x1,
	// MPropertyFriendlyName "Specified Material"
	CONTAINER_SOURCE_TYPE_SPECIFIC_MATERIAL = 0x2,
	// MPropertyFriendlyName "Loose Variables"
	CONTAINER_SOURCE_TYPE_LOOSE_VARIABLES = 0x3,
	// MPropertyFriendlyName "Variable from Target Material Attr"
	CONTAINER_SOURCE_TYPE_VARIABLE_FROM_TARGET_ATTR = 0x4,
	// MPropertyFriendlyName "Target Instance Material"
	CONTAINER_SOURCE_TYPE_TARGET_INSTANCE_MATERIAL = 0x5,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 10
// Alignment: 4
// Size: 0x4
enum class CompMatPropertyMutatorType_t : uint32_t
{
	// MPropertyFriendlyName "Init With"
	COMP_MAT_PROPERTY_MUTATOR_INIT = 0x0,
	// MPropertyFriendlyName "Copy Matching Keys From"
	COMP_MAT_PROPERTY_MUTATOR_COPY_MATCHING_KEYS = 0x1,
	// MPropertyFriendlyName "Copy Keys with Suffix"
	COMP_MAT_PROPERTY_MUTATOR_COPY_KEYS_WITH_SUFFIX = 0x2,
	// MPropertyFriendlyName "Copy Property From"
	COMP_MAT_PROPERTY_MUTATOR_COPY_PROPERTY = 0x3,
	// MPropertyFriendlyName "Set Value"
	COMP_MAT_PROPERTY_MUTATOR_SET_VALUE = 0x4,
	// MPropertyFriendlyName "Generate Texture"
	COMP_MAT_PROPERTY_MUTATOR_GENERATE_TEXTURE = 0x5,
	// MPropertyFriendlyName "Mutators"
	COMP_MAT_PROPERTY_MUTATOR_CONDITIONAL_MUTATORS = 0x6,
	// MPropertyFriendlyName "Pop Input Variable Queue"
	COMP_MAT_PROPERTY_MUTATOR_POP_INPUT_QUEUE = 0x7,
	// MPropertyFriendlyName "Draw Text"
	COMP_MAT_PROPERTY_MUTATOR_DRAW_TEXT = 0x8,
	// MPropertyFriendlyName "Random Roll Input Variables"
	COMP_MAT_PROPERTY_MUTATOR_RANDOM_ROLL_INPUT_VARIABLES = 0x9,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 2
// Alignment: 4
// Size: 0x4
enum class CompositeMaterialVarSystemVar_t : uint32_t
{
	// MPropertyFriendlyName "Composite Generation Time"
	COMPMATSYSVAR_COMPOSITETIME = 0x0,
	// MPropertyFriendlyName "Empty Resource Spacer"
	COMPMATSYSVAR_EMPTY_RESOURCE_SPACER = 0x1,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 6
// Alignment: 4
// Size: 0x4
enum class CompositeMaterialMatchFilterType_t : uint32_t
{
	// MPropertyFriendlyName "Target Material Attribute Exists"
	MATCH_FILTER_MATERIAL_ATTRIBUTE_EXISTS = 0x0,
	// MPropertyFriendlyName "Target Material Shader Name"
	MATCH_FILTER_MATERIAL_SHADER = 0x1,
	// MPropertyFriendlyName "Target Material Name SubStr"
	MATCH_FILTER_MATERIAL_NAME_SUBSTR = 0x2,
	// MPropertyFriendlyName "Target Material Attribute Equals"
	MATCH_FILTER_MATERIAL_ATTRIBUTE_EQUALS = 0x3,
	// MPropertyFriendlyName "Target Material Property Exists"
	MATCH_FILTER_MATERIAL_PROPERTY_EXISTS = 0x4,
	// MPropertyFriendlyName "Target Material Property Equals"
	MATCH_FILTER_MATERIAL_PROPERTY_EQUALS = 0x5,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class CompMatPropertyMutatorConditionType_t : uint32_t
{
	// MPropertyFriendlyName "Input Container Exists"
	COMP_MAT_MUTATOR_CONDITION_INPUT_CONTAINER_EXISTS = 0x0,
	// MPropertyFriendlyName "Input Container Variable Exists"
	COMP_MAT_MUTATOR_CONDITION_INPUT_CONTAINER_VALUE_EXISTS = 0x1,
	// MPropertyFriendlyName "Input Container Variable Exists and Equals"
	COMP_MAT_MUTATOR_CONDITION_INPUT_CONTAINER_VALUE_EQUALS = 0x2,
};

struct GameTime_t;
struct fogparams_t;
struct CCSGameModeRules;
struct C_RetakeGameRules;
struct CSkeletonInstance;
struct CRenderComponent;
struct CHitboxComponent;
struct CCollisionProperty;
struct CGlowProperty;
struct CNetworkViewOffsetVector;
struct CClientAlphaProperty;
struct C_PointCamera;
struct C_EnvWindShared;
struct AttachmentHandle_t;
struct GameTick_t;
struct C_fogplayerparams_t;
struct audioparams_t;
struct C_RopeKeyframe;
struct CGameSceneNode;
struct CNetworkVarChainer;
struct C_LightGlowOverlay;
struct CModelState;
struct CBaseAnimGraphController;
struct ParticleIndex_t;
struct CCSPlayer_BulletServices;
struct CCSPlayer_HostageServices;
struct CCSPlayer_BuyServices;
struct CCSPlayer_GlowServices;
struct CCSPlayer_ActionTrackingServices;
struct C_EconItemView;
struct EntitySpottedState_t;
struct CountdownTimer;
struct CPointOffScreenIndicatorUi;
struct C_PointClientUIWorldPanel;
struct sky3dparams_t;
struct C_SkyCamera;
struct CCSPlayer_PingServices;
struct CPlayer_ViewModelServices;
struct C_CSWeaponBase;
struct C_CommandContext;
struct CAnimGraphNetworkedVariables;
struct HSequence;
struct CBaseAnimGraph;
struct PhysicsRagdollPose_t;
struct AmmoIndex_t;
struct CPlayer_WeaponServices;
struct CPlayer_ItemServices;
struct CPlayer_AutoaimServices;
struct CPlayer_ObserverServices;
struct CPlayer_WaterServices;
struct CPlayer_UseServices;
struct CPlayer_FlashlightServices;
struct CPlayer_CameraServices;
struct CPlayer_MovementServices;
struct CBuoyancyHelper;
struct C_RopeKeyframe::CPhysicsDelegate;
struct TimedEvent;
struct CFireOverlay;
struct ModelConfigHandle_t;
struct CEntityIOOutput;
struct C_AttributeContainer;
struct C_CSGameRules;
struct CAttributeManager;
struct CAttributeList;
struct CInButtonState;
struct CSkillFloat;
struct CSMatchStats_t;
struct WeaponPurchaseTracker_t;
struct VPhysicsCollisionAttribute_t;
struct CPlayerSprayDecalRenderHelper;
struct shard_model_desc_t;
struct CLightComponent;
struct SceneEventId_t;
struct C_IronSightController;
struct CBodyComponent;
struct CNetworkTransmitComponent;
struct CNetworkVelocityVector;
struct CParticleProperty;
struct ChangeAccessorFieldPathIndex_t;
struct CEntityIdentity;
struct CPropDataComponent;
struct CFiringModeFloat;
struct CFiringModeInt;
struct CCSPlayerController_InGameMoneyServices;
struct CCSPlayerController_InventoryServices;
struct CCSPlayerController_ActionTrackingServices;
struct CCSPlayerController_DamageServices;
struct CScriptComponent;
struct CEntityInstance;
struct CGameSceneNodeHandle;
struct CNetworkOriginCellCoordQuantizedVector;
struct CCSPointScriptEntity;
struct CBasePlayerController;
struct CDecalInfo;
struct C_FireSmoke;
struct CompositeMaterialInputLooseVariable_t;

// Registered binary: client.dll (project 'entity2')
// Alignment: 8
// Size: 0x38
// Has VTable
// 
// MNetworkVarNames "CEntityIdentity * m_pEntity"
// MNetworkVarNames "CScriptComponent::Storage_t m_CScriptComponent"
class CEntityInstance
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; // 0x8	
	// MNetworkEnable
	// MNetworkPriority "56"
	CEntityIdentity* m_pEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0018[0x10]; // 0x18
public:
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; // 0x28	
	bool m_bVisibleinPVS; // 0x30	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xb0
// Has VTable
class C_IronSightController
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x10]; // 0x0
public:
	bool m_bIronSightAvailable; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0011[0x3]; // 0x11
public:
	float m_flIronSightAmount; // 0x14	
	float m_flIronSightAmountGained; // 0x18	
	float m_flIronSightAmountBiased; // 0x1c	
	float m_flIronSightAmount_Interpolated; // 0x20	
	float m_flIronSightAmountGained_Interpolated; // 0x24	
	float m_flIronSightAmountBiased_Interpolated; // 0x28	
	float m_flInterpolationLastUpdated; // 0x2c	
	QAngle m_angDeltaAverage[8]; // 0x30	
	QAngle m_angViewLast; // 0x90	
	Vector2D m_vecDotCoords; // 0x9c	
	float m_flDotBlur; // 0xa4	
	float m_flSpeedRatio; // 0xa8	
};

// Registered binary: client.dll (project 'entity2')
// Alignment: 8
// Size: 0x8
// Has VTable
// Is Abstract
// Has Trivial Destructor
class CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x58
// Has VTable
// 
// MNetworkVarNames "int32 m_iGlowType"
// MNetworkVarNames "int32 m_iGlowTeam"
// MNetworkVarNames "int32 m_nGlowRange"
// MNetworkVarNames "int32 m_nGlowRangeMin"
// MNetworkVarNames "Color m_glowColorOverride"
// MNetworkVarNames "bool m_bFlashing"
// MNetworkVarNames "float m_flGlowTime"
// MNetworkVarNames "float m_flGlowStartTime"
// MNetworkVarNames "bool m_bEligibleForScreenHighlight"
class CGlowProperty
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	Vector m_fGlowColor; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad0014[0x1c]; // 0x14
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowTypeChanged"
	int32_t m_iGlowType; // 0x30	
	// MNetworkEnable
	int32_t m_iGlowTeam; // 0x34	
	// MNetworkEnable
	int32_t m_nGlowRange; // 0x38	
	// MNetworkEnable
	int32_t m_nGlowRangeMin; // 0x3c	
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowColorChanged"
	Color m_glowColorOverride; // 0x40	
	// MNetworkEnable
	bool m_bFlashing; // 0x44	
private:
	[[maybe_unused]] uint8_t __pad0045[0x3]; // 0x45
public:
	// MNetworkEnable
	float m_flGlowTime; // 0x48	
	// MNetworkEnable
	float m_flGlowStartTime; // 0x4c	
	// MNetworkEnable
	bool m_bEligibleForScreenHighlight; // 0x50	
	bool m_bGlowing; // 0x51	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x1d8
// Has VTable
// 
// MNetworkVarNames "ButtonBitMask_t m_nToggleButtonDownMask"
// MNetworkVarNames "float32 m_flMaxspeed"
// MNetworkVarNames "float32 m_arrForceSubtickMoveWhen"
class CPlayer_MovementServices : public CPlayerPawnComponent
{
public:
	int32_t m_nImpulse; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad0044[0x4]; // 0x44
public:
	CInButtonState m_nButtons; // 0x48	
	uint64_t m_nQueuedButtonDownMask; // 0x68	
	uint64_t m_nQueuedButtonChangeMask; // 0x70	
	uint64_t m_nButtonDoublePressed; // 0x78	
	uint32_t m_pButtonPressedCmdNumber[64]; // 0x80	
	uint32_t m_nLastCommandNumberProcessed; // 0x180	
private:
	[[maybe_unused]] uint8_t __pad0184[0x4]; // 0x184
public:
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint64_t m_nToggleButtonDownMask; // 0x188	
private:
	[[maybe_unused]] uint8_t __pad0190[0x8]; // 0x190
public:
	// MNetworkEnable
	// MNetworkBitCount "12"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "2048.000000"
	// MNetworkEncodeFlags "1"
	float m_flMaxspeed; // 0x198	
	// MNetworkEnable
	float m_arrForceSubtickMoveWhen[4]; // 0x19c	
	float m_flForwardMove; // 0x1ac	
	float m_flLeftMove; // 0x1b0	
	float m_flUpMove; // 0x1b4	
	Vector m_vecLastMovementImpulses; // 0x1b8	
	QAngle m_vecOldViewAngles; // 0x1c4	
	
	// Datamap fields:
	// void m_pButtonPressedCmdNumber; // 0x80
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x68
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "Vector dirPrimary"
// MNetworkVarNames "Color colorPrimary"
// MNetworkVarNames "Color colorSecondary"
// MNetworkVarNames "Color colorPrimaryLerpTo"
// MNetworkVarNames "Color colorSecondaryLerpTo"
// MNetworkVarNames "float32 start"
// MNetworkVarNames "float32 end"
// MNetworkVarNames "float32 farz"
// MNetworkVarNames "float32 maxdensity"
// MNetworkVarNames "float32 exponent"
// MNetworkVarNames "float32 HDRColorScale"
// MNetworkVarNames "float32 skyboxFogFactor"
// MNetworkVarNames "float32 skyboxFogFactorLerpTo"
// MNetworkVarNames "float32 startLerpTo"
// MNetworkVarNames "float32 endLerpTo"
// MNetworkVarNames "float32 maxdensityLerpTo"
// MNetworkVarNames "GameTime_t lerptime"
// MNetworkVarNames "float32 duration"
// MNetworkVarNames "float32 blendtobackground"
// MNetworkVarNames "float32 scattering"
// MNetworkVarNames "float32 locallightscale"
// MNetworkVarNames "bool enable"
// MNetworkVarNames "bool blend"
// MNetworkVarNames "bool m_bNoReflectionFog"
struct fogparams_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEncoder "coord"
	Vector dirPrimary; // 0x8	
	// MNetworkEnable
	Color colorPrimary; // 0x14	
	// MNetworkEnable
	Color colorSecondary; // 0x18	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorPrimaryLerpTo; // 0x1c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorSecondaryLerpTo; // 0x20	
	// MNetworkEnable
	float start; // 0x24	
	// MNetworkEnable
	float end; // 0x28	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float farz; // 0x2c	
	// MNetworkEnable
	float maxdensity; // 0x30	
	// MNetworkEnable
	float exponent; // 0x34	
	// MNetworkEnable
	float HDRColorScale; // 0x38	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float skyboxFogFactor; // 0x3c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float skyboxFogFactorLerpTo; // 0x40	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float startLerpTo; // 0x44	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float endLerpTo; // 0x48	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float maxdensityLerpTo; // 0x4c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	GameTime_t lerptime; // 0x50	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float duration; // 0x54	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float blendtobackground; // 0x58	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float scattering; // 0x5c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float locallightscale; // 0x60	
	// MNetworkEnable
	bool enable; // 0x64	
	// MNetworkEnable
	bool blend; // 0x65	
	// MNetworkEnable
	bool m_bNoReflectionFog; // 0x66	
	bool m_bPadding; // 0x67	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x548
// Has VTable
// 
// MNetworkExcludeByName "m_bClientSideRagdoll"
// MNetworkExcludeByName "m_iMaxHealth"
// MNetworkExcludeByUserGroup "Player"
// MNetworkExcludeByUserGroup "Water"
// MNetworkExcludeByUserGroup "LocalPlayerExclusive"
// MNetworkExcludeByName "m_spawnflags"
// MNetworkExcludeByName "m_bTakesDamage"
// MNetworkExcludeByName "m_nTakeDamageFlags"
// MNetworkExcludeByName "m_vecAbsVelocity"
// MNetworkExcludeByName "m_flSpeed"
// MNetworkVarNames "CBodyComponent::Storage_t m_CBodyComponent"
// MNetworkVarNames "int32 m_iMaxHealth"
// MNetworkVarNames "int32 m_iHealth"
// MNetworkVarNames "uint8 m_lifeState"
// MNetworkVarNames "bool m_bTakesDamage"
// MNetworkVarNames "TakeDamageFlags_t m_nTakeDamageFlags"
// MNetworkVarNames "bool m_bIsPlatform"
// MNetworkVarNames "uint8 m_ubInterpolationFrame"
// MNetworkVarNames "EntitySubclassID_t m_nSubclassID"
// MNetworkVarNames "float32 m_flAnimTime"
// MNetworkVarNames "float32 m_flSimulationTime"
// MNetworkVarNames "GameTime_t m_flCreateTime"
// MNetworkVarNames "float m_flSpeed"
// MNetworkVarNames "bool m_bClientSideRagdoll"
// MNetworkVarNames "uint8 m_iTeamNum"
// MNetworkVarNames "uint32 m_spawnflags"
// MNetworkVarNames "GameTick_t m_nNextThinkTick"
// MNetworkVarNames "uint32 m_fFlags"
// MNetworkVarNames "Vector m_vecBaseVelocity"
// MNetworkVarNames "CHandle< CBaseEntity> m_hEffectEntity"
// MNetworkVarNames "CHandle< CBaseEntity> m_hOwnerEntity"
// MNetworkVarNames "MoveCollide_t m_MoveCollide"
// MNetworkVarNames "MoveType_t m_MoveType"
// MNetworkVarNames "float32 m_flWaterLevel"
// MNetworkVarNames "uint32 m_fEffects"
// MNetworkVarNames "CHandle< CBaseEntity> m_hGroundEntity"
// MNetworkVarNames "int m_nGroundBodyIndex"
// MNetworkVarNames "float32 m_flFriction"
// MNetworkVarNames "float32 m_flElasticity"
// MNetworkVarNames "float32 m_flGravityScale"
// MNetworkVarNames "float32 m_flTimeScale"
// MNetworkVarNames "bool m_bAnimatedEveryTick"
// MNetworkVarNames "GameTime_t m_flNavIgnoreUntilTime"
// MNetworkVarNames "BloodType m_nBloodType"
class C_BaseEntity : public CEntityInstance
{
public:
	// MNetworkEnable
	// MNetworkUserGroup "CBodyComponent"
	// MNetworkAlias "CBodyComponent"
	// MNetworkTypeAlias "CBodyComponent"
	// MNetworkPriority "48"
	CBodyComponent* m_CBodyComponent; // 0x38	
	CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad01e0[0x120]; // 0x1e0
public:
	GameTick_t m_nLastThinkTick; // 0x300	
private:
	[[maybe_unused]] uint8_t __pad0304[0x4]; // 0x304
public:
	CGameSceneNode* m_pGameSceneNode; // 0x308	
	CRenderComponent* m_pRenderComponent; // 0x310	
	CCollisionProperty* m_pCollision; // 0x318	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	int32_t m_iMaxHealth; // 0x320	
	// MNetworkEnable
	// MNetworkSerializer "ClampHealth"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	int32_t m_iHealth; // 0x324	
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	uint8_t m_lifeState; // 0x328	
	// MNetworkEnable
	bool m_bTakesDamage; // 0x329	
private:
	[[maybe_unused]] uint8_t __pad032a[0x6]; // 0x32a
public:
	// MNetworkEnable
	TakeDamageFlags_t m_nTakeDamageFlags; // 0x330	
	// MNetworkEnable
	bool m_bIsPlatform; // 0x338	
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationFrameChanged"
	uint8_t m_ubInterpolationFrame; // 0x339	
private:
	[[maybe_unused]] uint8_t __pad033a[0x2]; // 0x33a
public:
	CHandle<C_BaseEntity> m_hSceneObjectController; // 0x33c	
	int32_t m_nNoInterpolationTick; // 0x340	
	int32_t m_nVisibilityNoInterpolationTick; // 0x344	
	float m_flProxyRandomValue; // 0x348	
	int32_t m_iEFlags; // 0x34c	
	uint8_t m_nWaterType; // 0x350	
	bool m_bInterpolateEvenWithNoModel; // 0x351	
	bool m_bPredictionEligible; // 0x352	
	bool m_bApplyLayerMatchIDToModel; // 0x353	
	CUtlStringToken m_tokLayerMatchID; // 0x354	
	// MNetworkEnable
	// MNetworkChangeCallback "OnSubclassIDChanged"
	CUtlStringToken m_nSubclassID; // 0x358	
private:
	[[maybe_unused]] uint8_t __pad035c[0xc]; // 0x35c
public:
	int32_t m_nSimulationTick; // 0x368	
	int32_t m_iCurrentThinkContext; // 0x36c	
	CUtlVector<thinkfunc_t> m_aThinkFunctions; // 0x370	
	bool m_bDisabledContextThinks; // 0x388	
private:
	[[maybe_unused]] uint8_t __pad0389[0x3]; // 0x389
public:
	// MNetworkEnable
	// MNetworkPriority "0"
	// MNetworkSerializer "animTimeSerializer"
	float m_flAnimTime; // 0x38c	
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkSerializer "simulationTimeSerializer"
	// MNetworkChangeCallback "OnSimulationTimeChanged"
	float m_flSimulationTime; // 0x390	
	uint8_t m_nSceneObjectOverrideFlags; // 0x394	
	bool m_bHasSuccessfullyInterpolated; // 0x395	
	bool m_bHasAddedVarsToInterpolation; // 0x396	
	bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x397	
	int32_t m_nInterpolationLatchDirtyFlags[2]; // 0x398	
	uint16_t m_ListEntry[11]; // 0x3a0	
private:
	[[maybe_unused]] uint8_t __pad03b6[0x2]; // 0x3b6
public:
	// MNetworkEnable
	GameTime_t m_flCreateTime; // 0x3b8	
	// MNetworkEnable
	float m_flSpeed; // 0x3bc	
	uint16_t m_EntClientFlags; // 0x3c0	
	// MNetworkEnable
	bool m_bClientSideRagdoll; // 0x3c2	
	// MNetworkEnable
	// MNetworkChangeCallback "OnNetVarTeamNumChanged"
	uint8_t m_iTeamNum; // 0x3c3	
	// MNetworkEnable
	uint32_t m_spawnflags; // 0x3c4	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	GameTick_t m_nNextThinkTick; // 0x3c8	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	// MNetworkChangeCallback "OnFlagsChanged"
	uint32_t m_fFlags; // 0x3cc	
	Vector m_vecAbsVelocity; // 0x3d0	
private:
	[[maybe_unused]] uint8_t __pad03dc[0x4]; // 0x3dc
public:
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkChangeCallback "OnLocalVelocityChanged"
	// MNetworkPriority "32"
	CNetworkVelocityVector m_vecVelocity; // 0x3e0	
private:
	[[maybe_unused]] uint8_t __pad0408[0x8]; // 0x408
public:
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	Vector m_vecBaseVelocity; // 0x410	
	// MNetworkEnable
	CHandle<C_BaseEntity> m_hEffectEntity; // 0x41c	
	// MNetworkEnable
	// MNetworkPriority "32"
	CHandle<C_BaseEntity> m_hOwnerEntity; // 0x420	
	// MNetworkEnable
	MoveCollide_t m_MoveCollide; // 0x424	
	// MNetworkEnable
	// MNetworkChangeCallback "OnMoveTypeChanged"
	MoveType_t m_MoveType; // 0x425	
	MoveType_t m_nActualMoveType; // 0x426	
private:
	[[maybe_unused]] uint8_t __pad0427[0x1]; // 0x427
public:
	// MNetworkEnable
	// MNetworkUserGroup "Water"
	// MNetworkChangeCallback "OnWaterLevelChangeNetworked"
	// MNetworkBitCount "8"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1.000000"
	// MNetworkEncodeFlags "8"
	float m_flWaterLevel; // 0x428	
	// MNetworkEnable
	// MNetworkChangeCallback "OnEffectsChanged"
	uint32_t m_fEffects; // 0x42c	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	CHandle<C_BaseEntity> m_hGroundEntity; // 0x430	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	int32_t m_nGroundBodyIndex; // 0x434	
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "4.000000"
	// MNetworkEncodeFlags "1"
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFriction; // 0x438	
	// MNetworkEnable
	// MNetworkEncoder "coord"
	float m_flElasticity; // 0x43c	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flGravityScale; // 0x440	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flTimeScale; // 0x444	
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationAmountChanged"
	bool m_bAnimatedEveryTick; // 0x448	
private:
	[[maybe_unused]] uint8_t __pad0449[0x3]; // 0x449
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnNavIgnoreChanged"
	GameTime_t m_flNavIgnoreUntilTime; // 0x44c	
	uint16_t m_hThink; // 0x450	
private:
	[[maybe_unused]] uint8_t __pad0452[0xe]; // 0x452
public:
	uint8_t m_fBBoxVisFlags; // 0x460	
	bool m_bPredictable; // 0x461	
	bool m_bRenderWithViewModels; // 0x462	
private:
	[[maybe_unused]] uint8_t __pad0463[0x1]; // 0x463
public:
	CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x464	
	int32_t m_nFirstPredictableCommand; // 0x468	
	int32_t m_nLastPredictableCommand; // 0x46c	
	CHandle<C_BaseEntity> m_hOldMoveParent; // 0x470	
private:
	[[maybe_unused]] uint8_t __pad0474[0x4]; // 0x474
public:
	CParticleProperty m_Particles; // 0x478	
	CUtlVector<float32> m_vecPredictedScriptFloats; // 0x4a0	
	CUtlVector<int32> m_vecPredictedScriptFloatIDs; // 0x4b8	
private:
	[[maybe_unused]] uint8_t __pad04d0[0x18]; // 0x4d0
public:
	int32_t m_nNextScriptVarRecordID; // 0x4e8	
private:
	[[maybe_unused]] uint8_t __pad04ec[0xc]; // 0x4ec
public:
	QAngle m_vecAngVelocity; // 0x4f8	
	int32_t m_DataChangeEventRef; // 0x504	
	CUtlVector<CEntityHandle> m_dependencies; // 0x508	
	int32_t m_nCreationTick; // 0x520	
private:
	[[maybe_unused]] uint8_t __pad0524[0x9]; // 0x524
public:
	bool m_bAnimTimeChanged; // 0x52d	
	bool m_bSimulationTimeChanged; // 0x52e	
private:
	[[maybe_unused]] uint8_t __pad052f[0x9]; // 0x52f
public:
	CUtlString m_sUniqueHammerID; // 0x538	
	// MNetworkEnable
	BloodType m_nBloodType; // 0x540	
	
	// Static fields:
	static bool &Get_sm_bDatadescValidating(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[0]->m_instance);};
	static bool &Get_sm_bAccurateTriggerBboxChecks(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[1]->m_instance);};
	static bool &Get_sm_bDisableTouchFuncs(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[2]->m_instance);};
	static bool &Get_m_bAllowPrecache(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[3]->m_instance);};
	static LatchDirtyPermission_t &Get_s_nLatchPermissions(){return *reinterpret_cast<LatchDirtyPermission_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[4]->m_instance);};
	static int32_t &Get_m_nPredictionRandomSeed(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[5]->m_instance);};
	static CBasePlayerController* &Get_m_pPredictionPlayerController(){return *reinterpret_cast<CBasePlayerController**>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[6]->m_instance);};
	static bool &Get_s_bAbsQueriesValid(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[7]->m_instance);};
	static bool &Get_s_bAbsRecomputationEnabled(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[8]->m_instance);};
	static bool &Get_s_bComputingInterpolatedValues(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[9]->m_instance);};
	static bool &Get_s_bPreventingSetAnimRunAnimEvents(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[10]->m_instance);};
	static CUtlVector< C_BaseEntity* > &Get_gm_UsableObjects(){return *reinterpret_cast<CUtlVector< C_BaseEntity* >*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[11]->m_instance);};
	
	// Datamap fields:
	// CUtlSymbolLarge m_iszPrivateVScripts; // 0x8
	// void m_CScriptComponent; // 0x28
	// CUtlSymbolLarge subclass_name; // 0x7fffffff
	// void m_pSubclassVData; // 0x360
	// QAngle angles; // 0x7fffffff
	// Vector origin; // 0x7fffffff
	// CStrongHandle< InfoForResourceTypeCModel > model; // 0x7fffffff
	// CUtlString ownername; // 0x7fffffff
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x50
// Has VTable
// 
// MNetworkVarNames "int m_iReapplyProvisionParity"
// MNetworkVarNames "EHANDLE m_hOuter"
// MNetworkVarNames "attributeprovidertypes_t m_ProviderType"
class CAttributeManager
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	CUtlVector<CHandle<C_BaseEntity>> m_Providers; // 0x8	
	// MNetworkEnable
	int32_t m_iReapplyProvisionParity; // 0x20	
	// MNetworkEnable
	CHandle<C_BaseEntity> m_hOuter; // 0x24	
	bool m_bPreventLoopback; // 0x28	
private:
	[[maybe_unused]] uint8_t __pad0029[0x3]; // 0x29
public:
	// MNetworkEnable
	attributeprovidertypes_t m_ProviderType; // 0x2c	
	CUtlVector<CAttributeManager::cached_attribute_float_t> m_CachedResults; // 0x30	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x28
// Has VTable
// 
// MNetworkVarNames "uint32 m_bvDisabledHitGroups"
class CHitboxComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x1c]; // 0x8
public:
	// MNetworkEnable
	uint32_t m_bvDisabledHitGroups[1]; // 0x24	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_referenced_but_impl_is_contained(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[1]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x30
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "uint64 m_nInteractsAs"
// MNetworkVarNames "uint64 m_nInteractsWith"
// MNetworkVarNames "uint64 m_nInteractsExclude"
// MNetworkVarNames "uint32 m_nEntityId"
// MNetworkVarNames "uint32 m_nOwnerId"
// MNetworkVarNames "uint16 m_nHierarchyId"
// MNetworkVarNames "uint8 m_nCollisionGroup"
// MNetworkVarNames "uint8 m_nCollisionFunctionMask"
struct VPhysicsCollisionAttribute_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	uint64_t m_nInteractsAs; // 0x8	
	// MNetworkEnable
	uint64_t m_nInteractsWith; // 0x10	
	// MNetworkEnable
	uint64_t m_nInteractsExclude; // 0x18	
	// MNetworkEnable
	uint32_t m_nEntityId; // 0x20	
	// MNetworkEnable
	uint32_t m_nOwnerId; // 0x24	
	// MNetworkEnable
	uint16_t m_nHierarchyId; // 0x28	
	// MNetworkEnable
	uint8_t m_nCollisionGroup; // 0x2a	
	// MNetworkEnable
	uint8_t m_nCollisionFunctionMask; // 0x2b	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x40
// Has VTable
// Is Abstract
// 
// MNetworkVarNames "int m_nTotalPausedTicks"
// MNetworkVarNames "int m_nPauseStartTick"
// MNetworkVarNames "bool m_bGamePaused"
class C_GameRules
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x8	
	// MNetworkEnable
	int32_t m_nTotalPausedTicks; // 0x30	
	// MNetworkEnable
	int32_t m_nPauseStartTick; // 0x34	
	// MNetworkEnable
	bool m_bGamePaused; // 0x38	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xb0
// Has VTable
// 
// MNetworkVarNames "VPhysicsCollisionAttribute_t m_collisionAttribute"
// MNetworkVarNames "Vector m_vecMins"
// MNetworkVarNames "Vector m_vecMaxs"
// MNetworkVarNames "uint8 m_usSolidFlags"
// MNetworkVarNames "SolidType_t m_nSolidType"
// MNetworkVarNames "uint8 m_triggerBloat"
// MNetworkVarNames "SurroundingBoundsType_t m_nSurroundType"
// MNetworkVarNames "uint8 m_CollisionGroup"
// MNetworkVarNames "uint8 m_nEnablePhysics"
// MNetworkVarNames "Vector m_vecSpecifiedSurroundingMins"
// MNetworkVarNames "Vector m_vecSpecifiedSurroundingMaxs"
// MNetworkVarNames "Vector m_vCapsuleCenter1"
// MNetworkVarNames "Vector m_vCapsuleCenter2"
// MNetworkVarNames "float m_flCapsuleRadius"
class CCollisionProperty
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x10]; // 0x0
public:
	// MNetworkEnable
	// MNetworkChangeCallback "CollisionAttributeChanged"
	// -> m_nInteractsAs - 0x18
	// -> m_nInteractsWith - 0x20
	// -> m_nInteractsExclude - 0x28
	// -> m_nEntityId - 0x30
	// -> m_nOwnerId - 0x34
	// -> m_nHierarchyId - 0x38
	// -> m_nCollisionGroup - 0x3a
	// -> m_nCollisionFunctionMask - 0x3b
	VPhysicsCollisionAttribute_t m_collisionAttribute; // 0x10	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateOBB"
	Vector m_vecMins; // 0x40	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateOBB"
	Vector m_vecMaxs; // 0x4c	
private:
	[[maybe_unused]] uint8_t __pad0058[0x2]; // 0x58
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateSolidFlags"
	uint8_t m_usSolidFlags; // 0x5a	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateSolidType"
	SolidType_t m_nSolidType; // 0x5b	
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	uint8_t m_triggerBloat; // 0x5c	
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	SurroundingBoundsType_t m_nSurroundType; // 0x5d	
	// MNetworkEnable
	uint8_t m_CollisionGroup; // 0x5e	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateEnablePhysics"
	uint8_t m_nEnablePhysics; // 0x5f	
	float m_flBoundingRadius; // 0x60	
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	Vector m_vecSpecifiedSurroundingMins; // 0x64	
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	Vector m_vecSpecifiedSurroundingMaxs; // 0x70	
	Vector m_vecSurroundingMaxs; // 0x7c	
	Vector m_vecSurroundingMins; // 0x88	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateCapsule"
	Vector m_vCapsuleCenter1; // 0x94	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateCapsule"
	Vector m_vCapsuleCenter2; // 0xa0	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateCapsule"
	float m_flCapsuleRadius; // 0xac	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x60
// Has VTable
// 
// MNetworkVarNames "CEconItemAttribute m_Attributes"
class CAttributeList
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkTypeAlias "CUtlVector< CEconItemAttribute >"
	C_UtlVectorEmbeddedNetworkVar<CEconItemAttribute> m_Attributes; // 0x8	
	CAttributeManager* m_pManager; // 0x58	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xcc8
// Has VTable
// 
// MNetworkVarNames "CRenderComponent::Storage_t m_CRenderComponent"
// MNetworkVarNames "CHitboxComponent::Storage_t m_CHitboxComponent"
// MNetworkVarNames "RenderMode_t m_nRenderMode"
// MNetworkVarNames "RenderFx_t m_nRenderFX"
// MNetworkVarNames "Color m_clrRender"
// MNetworkVarNames "EntityRenderAttribute_t m_vecRenderAttributes"
// MNetworkVarNames "bool m_bRenderToCubemaps"
// MNetworkVarNames "CCollisionProperty m_Collision"
// MNetworkVarNames "CGlowProperty m_Glow"
// MNetworkVarNames "float m_flGlowBackfaceMult"
// MNetworkVarNames "float32 m_fadeMinDist"
// MNetworkVarNames "float32 m_fadeMaxDist"
// MNetworkVarNames "float32 m_flFadeScale"
// MNetworkVarNames "float32 m_flShadowStrength"
// MNetworkVarNames "uint8 m_nObjectCulling"
// MNetworkVarNames "int m_nAddDecal"
// MNetworkVarNames "Vector m_vDecalPosition"
// MNetworkVarNames "Vector m_vDecalForwardAxis"
// MNetworkVarNames "float m_flDecalHealBloodRate"
// MNetworkVarNames "float m_flDecalHealHeightRate"
// MNetworkVarNames "CHandle< C_BaseModelEntity > m_ConfigEntitiesToPropagateMaterialDecalsTo"
class C_BaseModelEntity : public C_BaseEntity
{
private:
	[[maybe_unused]] uint8_t __pad0548[0x4d0]; // 0x548
public:
	// MNetworkEnable
	// MNetworkUserGroup "CRenderComponent"
	// MNetworkAlias "CRenderComponent"
	// MNetworkTypeAlias "CRenderComponent"
	CRenderComponent* m_CRenderComponent; // 0xa18	
	// MNetworkEnable
	// MNetworkUserGroup "CHitboxComponent"
	// MNetworkAlias "CHitboxComponent"
	// MNetworkTypeAlias "CHitboxComponent"
	CHitboxComponent m_CHitboxComponent; // 0xa20	
private:
	[[maybe_unused]] uint8_t __pad0a48[0x20]; // 0xa48
public:
	bool m_bInitModelEffects; // 0xa68	
	bool m_bIsStaticProp; // 0xa69	
private:
	[[maybe_unused]] uint8_t __pad0a6a[0x2]; // 0xa6a
public:
	int32_t m_nLastAddDecal; // 0xa6c	
	int32_t m_nDecalsAdded; // 0xa70	
	int32_t m_iOldHealth; // 0xa74	
	// MNetworkEnable
	// MNetworkChangeCallback "OnRenderModeChanged"
	RenderMode_t m_nRenderMode; // 0xa78	
	// MNetworkEnable
	RenderFx_t m_nRenderFX; // 0xa79	
	bool m_bAllowFadeInView; // 0xa7a	
	// MNetworkEnable
	// MNetworkChangeCallback "OnColorChanged"
	Color m_clrRender; // 0xa7b	
private:
	[[maybe_unused]] uint8_t __pad0a7f[0x1]; // 0xa7f
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnRenderAttributesChanged"
	C_UtlVectorEmbeddedNetworkVar<EntityRenderAttribute_t> m_vecRenderAttributes; // 0xa80	
private:
	[[maybe_unused]] uint8_t __pad0ad0[0x18]; // 0xad0
public:
	// MNetworkEnable
	bool m_bRenderToCubemaps; // 0xae8	
private:
	[[maybe_unused]] uint8_t __pad0ae9[0x7]; // 0xae9
public:
	// MNetworkEnable
	CCollisionProperty m_Collision; // 0xaf0	
	// MNetworkEnable
	// -> m_fGlowColor - 0xba8
	// -> m_iGlowType - 0xbd0
	// -> m_iGlowTeam - 0xbd4
	// -> m_nGlowRange - 0xbd8
	// -> m_nGlowRangeMin - 0xbdc
	// -> m_glowColorOverride - 0xbe0
	// -> m_bFlashing - 0xbe4
	// -> m_flGlowTime - 0xbe8
	// -> m_flGlowStartTime - 0xbec
	// -> m_bEligibleForScreenHighlight - 0xbf0
	// -> m_bGlowing - 0xbf1
	CGlowProperty m_Glow; // 0xba0	
	// MNetworkEnable
	float m_flGlowBackfaceMult; // 0xbf8	
	// MNetworkEnable
	float m_fadeMinDist; // 0xbfc	
	// MNetworkEnable
	float m_fadeMaxDist; // 0xc00	
	// MNetworkEnable
	float m_flFadeScale; // 0xc04	
	// MNetworkEnable
	float m_flShadowStrength; // 0xc08	
	// MNetworkEnable
	uint8_t m_nObjectCulling; // 0xc0c	
private:
	[[maybe_unused]] uint8_t __pad0c0d[0x3]; // 0xc0d
public:
	// MNetworkEnable
	int32_t m_nAddDecal; // 0xc10	
	// MNetworkEnable
	Vector m_vDecalPosition; // 0xc14	
	// MNetworkEnable
	Vector m_vDecalForwardAxis; // 0xc20	
	// MNetworkEnable
	float m_flDecalHealBloodRate; // 0xc2c	
	// MNetworkEnable
	float m_flDecalHealHeightRate; // 0xc30	
private:
	[[maybe_unused]] uint8_t __pad0c34[0x4]; // 0xc34
public:
	// MNetworkEnable
	C_NetworkUtlVectorBase<CHandle<C_BaseModelEntity>> m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0xc38	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	// MNetworkChangeCallback "OnViewOffsetChanged"
	CNetworkViewOffsetVector m_vecViewOffset; // 0xc50	
private:
	[[maybe_unused]] uint8_t __pad0c78[0x8]; // 0xc78
public:
	CClientAlphaProperty* m_pClientAlphaProperty; // 0xc80	
	Color m_ClientOverrideTint; // 0xc88	
	bool m_bUseClientOverrideTint; // 0xc8c	
	
	// Datamap fields:
	// int32_t InputAlpha; // 0x0
	// Color InputColor; // 0x0
	// int32_t InputSkin; // 0x0
	// CUtlString add_attribute; // 0x7fffffff
	// void m_Ropes; // 0xa48
	// Color rendercolor32; // 0x7fffffff
	// Color rendercolor; // 0x7fffffff
	// int32_t renderamt; // 0x7fffffff
	// Vector mins; // 0x7fffffff
	// Vector maxs; // 0x7fffffff
	// const char * skin; // 0x7fffffff
	// CUtlString bodygroups; // 0x7fffffff
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xed0
// Has VTable
// 
// MNetworkIncludeByName "m_bClientSideRagdoll"
// MNetworkVarNames "bool m_bInitiallyPopulateInterpHistory"
// MNetworkVarNames "bool m_bAnimGraphUpdateEnabled"
// MNetworkVarNames "Vector m_vecForce"
// MNetworkVarNames "int32 m_nForceBone"
// MNetworkVarNames "PhysicsRagdollPose_t* m_pRagdollPose"
// MNetworkVarNames "bool m_bRagdollClientSide"
class CBaseAnimGraph : public C_BaseModelEntity
{
private:
	[[maybe_unused]] uint8_t __pad0cc8[0x78]; // 0xcc8
public:
	// MNetworkEnable
	bool m_bInitiallyPopulateInterpHistory; // 0xd40	
private:
	[[maybe_unused]] uint8_t __pad0d41[0x1]; // 0xd41
public:
	bool m_bSuppressAnimEventSounds; // 0xd42	
private:
	[[maybe_unused]] uint8_t __pad0d43[0xd]; // 0xd43
public:
	// MNetworkEnable
	bool m_bAnimGraphUpdateEnabled; // 0xd50	
private:
	[[maybe_unused]] uint8_t __pad0d51[0x3]; // 0xd51
public:
	float m_flMaxSlopeDistance; // 0xd54	
	Vector m_vLastSlopeCheckPos; // 0xd58	
	bool m_bAnimationUpdateScheduled; // 0xd64	
private:
	[[maybe_unused]] uint8_t __pad0d65[0x3]; // 0xd65
public:
	// MNetworkEnable
	Vector m_vecForce; // 0xd68	
	// MNetworkEnable
	int32_t m_nForceBone; // 0xd74	
	CBaseAnimGraph* m_pClientsideRagdoll; // 0xd78	
	bool m_bBuiltRagdoll; // 0xd80	
private:
	[[maybe_unused]] uint8_t __pad0d81[0x17]; // 0xd81
public:
	// MNetworkEnable
	PhysicsRagdollPose_t* m_pRagdollPose; // 0xd98	
	// MNetworkEnable
	// MNetworkChangeCallback "OnClientRagdollChanged"
	bool m_bRagdollClientSide; // 0xda0	
private:
	[[maybe_unused]] uint8_t __pad0da1[0xf]; // 0xda1
public:
	bool m_bHasAnimatedMaterialAttributes; // 0xdb0	
	
	// Datamap fields:
	// void m_pMainGraphController; // 0xd38
	// float InputSetPlaybackRate; // 0x0
	// CUtlSymbolLarge InputSetBodyGroup; // 0x0
	// bool InputDisableAnimEventSounds; // 0x0
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x1068
// Has VTable
// 
// MNetworkVarNames "float32 m_flexWeight"
// MNetworkVarNames "bool m_blinktoggle"
class C_BaseFlex : public CBaseAnimGraph
{
private:
	[[maybe_unused]] uint8_t __pad0ed0[0x10]; // 0xed0
public:
	// MNetworkEnable
	// MNetworkBitCount "12"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1.000000"
	// MNetworkEncodeFlags "1"
	C_NetworkUtlVectorBase<float32> m_flexWeight; // 0xee0	
	// MNetworkEnable
	// MNetworkEncoder "coord"
	// MNetworkChangeCallback "OnViewTargetChanged"
	Vector m_vLookTargetPosition; // 0xef8	
private:
	[[maybe_unused]] uint8_t __pad0f04[0xc]; // 0xf04
public:
	// MNetworkEnable
	bool m_blinktoggle; // 0xf10	
private:
	[[maybe_unused]] uint8_t __pad0f11[0x5f]; // 0xf11
public:
	int32_t m_nLastFlexUpdateFrameCount; // 0xf70	
	Vector m_CachedViewTarget; // 0xf74	
	SceneEventId_t m_nNextSceneEventId; // 0xf80	
	int32_t m_iBlink; // 0xf84	
	float m_blinktime; // 0xf88	
	bool m_prevblinktoggle; // 0xf8c	
private:
	[[maybe_unused]] uint8_t __pad0f8d[0x3]; // 0xf8d
public:
	int32_t m_iJawOpen; // 0xf90	
	float m_flJawOpenAmount; // 0xf94	
	float m_flBlinkAmount; // 0xf98	
	AttachmentHandle_t m_iMouthAttachment; // 0xf9c	
	AttachmentHandle_t m_iEyeAttachment; // 0xf9d	
	bool m_bResetFlexWeightsOnModelChange; // 0xf9e	
private:
	[[maybe_unused]] uint8_t __pad0f9f[0x19]; // 0xf9f
public:
	int32_t m_nEyeOcclusionRendererBone; // 0xfb8	
	matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0xfbc	
	Vector m_vEyeOcclusionRendererHalfExtent; // 0xfec	
private:
	[[maybe_unused]] uint8_t __pad0ff8[0x10]; // 0xff8
public:
	C_BaseFlex::Emphasized_Phoneme m_PhonemeClasses[3]; // 0x1008	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xcd8
// Has VTable
// 
// MNetworkVarNames "float32 m_flLightScale"
// MNetworkVarNames "float32 m_Radius"
class C_SpotlightEnd : public C_BaseModelEntity
{
public:
	// MNetworkEnable
	float m_flLightScale; // 0xcc8	
	// MNetworkEnable
	float m_Radius; // 0xccc	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x48
// Has VTable
// 
// MNetworkVarNames "attrib_definition_index_t m_iAttributeDefinitionIndex"
// MNetworkVarNames "float m_flValue"
// MNetworkVarNames "float m_flInitialValue"
// MNetworkVarNames "int m_nRefundableCurrency"
// MNetworkVarNames "bool m_bSetBonus"
class CEconItemAttribute
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x30]; // 0x0
public:
	// MNetworkEnable
	uint16_t m_iAttributeDefinitionIndex; // 0x30	
private:
	[[maybe_unused]] uint8_t __pad0032[0x2]; // 0x32
public:
	// MNetworkEnable
	// MNetworkAlias "m_iRawValue32"
	float m_flValue; // 0x34	
	// MNetworkEnable
	float m_flInitialValue; // 0x38	
	// MNetworkEnable
	int32_t m_nRefundableCurrency; // 0x3c	
	// MNetworkEnable
	bool m_bSetBonus; // 0x40	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x448
// Has VTable
// 
// MNetworkVarNames "item_definition_index_t m_iItemDefinitionIndex"
// MNetworkVarNames "int m_iEntityQuality"
// MNetworkVarNames "uint32 m_iEntityLevel"
// MNetworkVarNames "uint32 m_iItemIDHigh"
// MNetworkVarNames "uint32 m_iItemIDLow"
// MNetworkVarNames "uint32 m_iAccountID"
// MNetworkVarNames "uint32 m_iInventoryPosition"
// MNetworkVarNames "bool m_bInitialized"
// MNetworkVarNames "CAttributeList m_AttributeList"
// MNetworkVarNames "CAttributeList m_NetworkedDynamicAttributes"
// MNetworkVarNames "char m_szCustomName"
class C_EconItemView : public IEconItemInterface
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x58]; // 0x8
public:
	bool m_bInventoryImageRgbaRequested; // 0x60	
	bool m_bInventoryImageTriedCache; // 0x61	
private:
	[[maybe_unused]] uint8_t __pad0062[0x1e]; // 0x62
public:
	int32_t m_nInventoryImageRgbaWidth; // 0x80	
	int32_t m_nInventoryImageRgbaHeight; // 0x84	
	char m_szCurrentLoadCachedFileName[260]; // 0x88	
private:
	[[maybe_unused]] uint8_t __pad018c[0x2c]; // 0x18c
public:
	bool m_bRestoreCustomMaterialAfterPrecache; // 0x1b8	
private:
	[[maybe_unused]] uint8_t __pad01b9[0x1]; // 0x1b9
public:
	// MNetworkEnable
	uint16_t m_iItemDefinitionIndex; // 0x1ba	
	// MNetworkEnable
	int32_t m_iEntityQuality; // 0x1bc	
	// MNetworkEnable
	uint32_t m_iEntityLevel; // 0x1c0	
private:
	[[maybe_unused]] uint8_t __pad01c4[0x4]; // 0x1c4
public:
	uint64_t m_iItemID; // 0x1c8	
	// MNetworkEnable
	uint32_t m_iItemIDHigh; // 0x1d0	
	// MNetworkEnable
	uint32_t m_iItemIDLow; // 0x1d4	
	// MNetworkEnable
	uint32_t m_iAccountID; // 0x1d8	
	// MNetworkEnable
	uint32_t m_iInventoryPosition; // 0x1dc	
private:
	[[maybe_unused]] uint8_t __pad01e0[0x8]; // 0x1e0
public:
	// MNetworkEnable
	bool m_bInitialized; // 0x1e8	
	bool m_bDisallowSOC; // 0x1e9	
	bool m_bIsStoreItem; // 0x1ea	
	bool m_bIsTradeItem; // 0x1eb	
	int32_t m_iEntityQuantity; // 0x1ec	
	int32_t m_iRarityOverride; // 0x1f0	
	int32_t m_iQualityOverride; // 0x1f4	
	uint8_t m_unClientFlags; // 0x1f8	
	uint8_t m_unOverrideStyle; // 0x1f9	
private:
	[[maybe_unused]] uint8_t __pad01fa[0x16]; // 0x1fa
public:
	// MNetworkEnable
	// -> m_Attributes - 0x218
	// -> m_pManager - 0x268
	CAttributeList m_AttributeList; // 0x210	
	// MNetworkEnable
	// -> m_Attributes - 0x278
	// -> m_pManager - 0x2c8
	CAttributeList m_NetworkedDynamicAttributes; // 0x270	
	// MNetworkEnable
	char m_szCustomName[161]; // 0x2d0	
	char m_szCustomNameOverride[161]; // 0x371	
private:
	[[maybe_unused]] uint8_t __pad0412[0x2e]; // 0x412
public:
	bool m_bInitializedTags; // 0x440	
	
	// Static fields:
	static bool &Get_m_sbHasCleanedInventoryImageCacheDir(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_EconItemView")->m_static_fields[0]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x1
// Has Trivial Constructor
// Has Trivial Destructor
// 
// MPulseProvideFeatureTag
// MPulseLibraryBindings
class CCSPointScriptExtensions_weapon_cs_base
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x1]; // 0x0
public:
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xcd0
// Has VTable
// 
// MNetworkVarNames "CLightComponent::Storage_t m_CLightComponent"
class C_LightEntity : public C_BaseModelEntity
{
public:
	// MNetworkEnable
	// MNetworkUserGroup "CLightComponent"
	// MNetworkAlias "CLightComponent"
	// MNetworkTypeAlias "CLightComponent"
	CLightComponent* m_CLightComponent; // 0xcc8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x208
// Has VTable
// 
// MNetworkVarNames "GameTime_t m_flStartTime"
// MNetworkVarNames "uint32 m_iWindSeed"
// MNetworkVarNames "uint16 m_iMinWind"
// MNetworkVarNames "uint16 m_iMaxWind"
// MNetworkVarNames "int32 m_windRadius"
// MNetworkVarNames "uint16 m_iMinGust"
// MNetworkVarNames "uint16 m_iMaxGust"
// MNetworkVarNames "float32 m_flMinGustDelay"
// MNetworkVarNames "float32 m_flMaxGustDelay"
// MNetworkVarNames "float32 m_flGustDuration"
// MNetworkVarNames "uint16 m_iGustDirChange"
// MNetworkVarNames "Vector m_location"
// MNetworkVarNames "uint16 m_iInitialWindDir"
// MNetworkVarNames "float32 m_flInitialWindSpeed"
class C_EnvWindShared
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	GameTime_t m_flStartTime; // 0x8	
	// MNetworkEnable
	uint32_t m_iWindSeed; // 0xc	
	// MNetworkEnable
	uint16_t m_iMinWind; // 0x10	
	// MNetworkEnable
	uint16_t m_iMaxWind; // 0x12	
	// MNetworkEnable
	int32_t m_windRadius; // 0x14	
	// MNetworkEnable
	uint16_t m_iMinGust; // 0x18	
	// MNetworkEnable
	uint16_t m_iMaxGust; // 0x1a	
	// MNetworkEnable
	float m_flMinGustDelay; // 0x1c	
	// MNetworkEnable
	float m_flMaxGustDelay; // 0x20	
	// MNetworkEnable
	float m_flGustDuration; // 0x24	
	// MNetworkEnable
	uint16_t m_iGustDirChange; // 0x28	
private:
	[[maybe_unused]] uint8_t __pad002a[0x2]; // 0x2a
public:
	// MNetworkEnable
	// MNetworkEncoder "coord"
	Vector m_location; // 0x2c	
	int32_t m_iszGustSound; // 0x38	
	int32_t m_iWindDir; // 0x3c	
	float m_flWindSpeed; // 0x40	
	Vector m_currentWindVector; // 0x44	
	Vector m_CurrentSwayVector; // 0x50	
	Vector m_PrevSwayVector; // 0x5c	
	// MNetworkEnable
	uint16_t m_iInitialWindDir; // 0x68	
private:
	[[maybe_unused]] uint8_t __pad006a[0x2]; // 0x6a
public:
	// MNetworkEnable
	float m_flInitialWindSpeed; // 0x6c	
	GameTime_t m_flVariationTime; // 0x70	
	GameTime_t m_flSwayTime; // 0x74	
	GameTime_t m_flSimTime; // 0x78	
	GameTime_t m_flSwitchTime; // 0x7c	
	float m_flAveWindSpeed; // 0x80	
	bool m_bGusting; // 0x84	
private:
	[[maybe_unused]] uint8_t __pad0085[0x3]; // 0x85
public:
	float m_flWindAngleVariation; // 0x88	
	float m_flWindSpeedVariation; // 0x8c	
	CEntityIndex m_iEntIndex; // 0x90	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x548
// Has VTable
class C_GameRulesProxy : public C_BaseEntity
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x10f8
// Has VTable
// 
// MNetworkExcludeByUserGroup "LocalPlayerExclusive"
// MNetworkVarNames "CHandle<C_EconWearable > m_hMyWearables"
// MNetworkVarNames "float m_flFieldOfView"
class C_BaseCombatCharacter : public C_BaseFlex
{
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnWearablesChanged"
	C_NetworkUtlVectorBase<CHandle<C_EconWearable>> m_hMyWearables; // 0x1068	
	AttachmentHandle_t m_leftFootAttachment; // 0x1080	
	AttachmentHandle_t m_rightFootAttachment; // 0x1081	
private:
	[[maybe_unused]] uint8_t __pad1082[0x2]; // 0x1082
public:
	C_BaseCombatCharacter::WaterWakeMode_t m_nWaterWakeMode; // 0x1084	
	float m_flWaterWorldZ; // 0x1088	
	float m_flWaterNextTraceTime; // 0x108c	
	// MNetworkEnable
	float m_flFieldOfView; // 0x1090	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x10b8
// Has VTable
// 
// MNetworkIncludeByName "m_fFlags"
// MNetworkIncludeByName "m_vecVelocity"
// MNetworkExcludeByName "m_flexWeight"
// MNetworkExcludeByName "m_blinktoggle"
// MNetworkExcludeByUserGroup "m_flPoseParameter"
// MNetworkExcludeByName "m_nResetEventsParity"
// MNetworkExcludeByUserGroup "overlay_vars"
// MNetworkExcludeByName "m_flAnimTime"
// MNetworkExcludeByUserGroup "m_flCycle"
// MNetworkExcludeByName "m_baseLayer.m_hSequence"
// MNetworkExcludeByName "m_animationController.m_flPlaybackRate"
// MNetworkExcludeByName "m_nNewSequenceParity"
// MNetworkVarNames "bool m_bIsLive"
// MNetworkVarNames "float32 m_DmgRadius"
// MNetworkVarNames "GameTime_t m_flDetonateTime"
// MNetworkVarNames "float32 m_flDamage"
// MNetworkVarNames "CHandle< CCSPlayerPawn > m_hThrower"
class C_BaseGrenade : public C_BaseFlex
{
public:
	bool m_bHasWarnedAI; // 0x1068	
	bool m_bIsSmokeGrenade; // 0x1069	
	// MNetworkEnable
	bool m_bIsLive; // 0x106a	
private:
	[[maybe_unused]] uint8_t __pad106b[0x1]; // 0x106b
public:
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1024.000000"
	// MNetworkEncodeFlags "1"
	float m_DmgRadius; // 0x106c	
	// MNetworkEnable
	GameTime_t m_flDetonateTime; // 0x1070	
	float m_flWarnAITime; // 0x1074	
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "256.000000"
	// MNetworkEncodeFlags "1"
	float m_flDamage; // 0x1078	
private:
	[[maybe_unused]] uint8_t __pad107c[0x4]; // 0x107c
public:
	CUtlSymbolLarge m_iszBounceSound; // 0x1080	
	CUtlString m_ExplosionSound; // 0x1088	
private:
	[[maybe_unused]] uint8_t __pad1090[0x4]; // 0x1090
public:
	// MNetworkEnable
	CHandle<C_CSPlayerPawn> m_hThrower; // 0x1094	
private:
	[[maybe_unused]] uint8_t __pad1098[0x14]; // 0x1098
public:
	GameTime_t m_flNextAttack; // 0x10ac	
	CHandle<C_CSPlayerPawn> m_hOriginalThrower; // 0x10b0	
	
	// Datamap fields:
	// int32_t m_nExplosionType; // 0x1090
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x548
// Has VTable
class C_SoundEventEntity : public C_BaseEntity
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x40
// Has VTable
class CPlayer_ViewModelServices : public CPlayerPawnComponent
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x4a8
// Has VTable
// 
// MNetworkIncludeByName "m_ProviderType"
// MNetworkIncludeByName "m_hOuter"
// MNetworkIncludeByName "m_iReapplyProvisionParity"
// MNetworkIncludeByName "m_Item"
// MNetworkVarNames "CEconItemView m_Item"
class C_AttributeContainer : public CAttributeManager
{
public:
	// MNetworkEnable
	C_EconItemView m_Item; // 0x50	
	int32_t m_iExternalItemProviderRegisteredToken; // 0x498	
private:
	[[maybe_unused]] uint8_t __pad049c[0x4]; // 0x49c
public:
	uint64_t m_ullRegisteredAsItemID; // 0x4a0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x15b0
// Has VTable
// 
// MNetworkVarNames "CAttributeContainer m_AttributeManager"
// MNetworkVarNames "uint32 m_OriginalOwnerXuidLow"
// MNetworkVarNames "uint32 m_OriginalOwnerXuidHigh"
// MNetworkVarNames "int m_nFallbackPaintKit"
// MNetworkVarNames "int m_nFallbackSeed"
// MNetworkVarNames "float m_flFallbackWear"
// MNetworkVarNames "int m_nFallbackStatTrak"
class C_EconEntity : public C_BaseFlex
{
private:
	[[maybe_unused]] uint8_t __pad1068[0x10]; // 0x1068
public:
	float m_flFlexDelayTime; // 0x1078	
private:
	[[maybe_unused]] uint8_t __pad107c[0x4]; // 0x107c
public:
	float32* m_flFlexDelayedWeight; // 0x1080	
	bool m_bAttributesInitialized; // 0x1088	
private:
	[[maybe_unused]] uint8_t __pad1089[0x7]; // 0x1089
public:
	// MNetworkEnable
	// -> m_Item - 0x10e0
	// -> m_iExternalItemProviderRegisteredToken - 0x1528
	// -> m_ullRegisteredAsItemID - 0x1530
	C_AttributeContainer m_AttributeManager; // 0x1090	
	// MNetworkEnable
	uint32_t m_OriginalOwnerXuidLow; // 0x1538	
	// MNetworkEnable
	uint32_t m_OriginalOwnerXuidHigh; // 0x153c	
	// MNetworkEnable
	int32_t m_nFallbackPaintKit; // 0x1540	
	// MNetworkEnable
	int32_t m_nFallbackSeed; // 0x1544	
	// MNetworkEnable
	float m_flFallbackWear; // 0x1548	
	// MNetworkEnable
	int32_t m_nFallbackStatTrak; // 0x154c	
	bool m_bClientside; // 0x1550	
	bool m_bParticleSystemsCreated; // 0x1551	
private:
	[[maybe_unused]] uint8_t __pad1552[0x6]; // 0x1552
public:
	CUtlVector<int32> m_vecAttachedParticles; // 0x1558	
	CHandle<CBaseAnimGraph> m_hViewmodelAttachment; // 0x1570	
	int32_t m_iOldTeam; // 0x1574	
	bool m_bAttachmentDirty; // 0x1578	
private:
	[[maybe_unused]] uint8_t __pad1579[0x3]; // 0x1579
public:
	int32_t m_nUnloadedModelIndex; // 0x157c	
	int32_t m_iNumOwnerValidationRetries; // 0x1580	
private:
	[[maybe_unused]] uint8_t __pad1584[0xc]; // 0x1584
public:
	CHandle<C_BaseEntity> m_hOldProvidee; // 0x1590	
private:
	[[maybe_unused]] uint8_t __pad1594[0x4]; // 0x1594
public:
	CUtlVector<C_EconEntity::AttachedModelData_t> m_vecAttachedModels; // 0x1598	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x548
// Has VTable
class C_PointEntity : public C_BaseEntity
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x5a8
// Has VTable
// 
// MNetworkVarNames "bool m_bIsPlayingBack"
// MNetworkVarNames "bool m_bPaused"
// MNetworkVarNames "bool m_bMultiplayer"
// MNetworkVarNames "bool m_bAutogenerated"
// MNetworkVarNames "float32 m_flForceClientTime"
// MNetworkVarNames "uint16 m_nSceneStringIndex"
// MNetworkVarNames "CHandle< C_BaseFlex > m_hActorList"
class C_SceneEntity : public C_PointEntity
{
private:
	[[maybe_unused]] uint8_t __pad0548[0x8]; // 0x548
public:
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x550	
	// MNetworkEnable
	bool m_bPaused; // 0x551	
	// MNetworkEnable
	bool m_bMultiplayer; // 0x552	
	// MNetworkEnable
	bool m_bAutogenerated; // 0x553	
	// MNetworkEnable
	// MNetworkChangeCallback "OnResetClientTime"
	float m_flForceClientTime; // 0x554	
	// MNetworkEnable
	// MNetworkPriority "32"
	uint16_t m_nSceneStringIndex; // 0x558	
	bool m_bClientOnly; // 0x55a	
private:
	[[maybe_unused]] uint8_t __pad055b[0x1]; // 0x55b
public:
	CHandle<C_BaseFlex> m_hOwner; // 0x55c	
	// MNetworkEnable
	// MNetworkPriority "32"
	C_NetworkUtlVectorBase<CHandle<C_BaseFlex>> m_hActorList; // 0x560	
	bool m_bWasPlaying; // 0x578	
private:
	[[maybe_unused]] uint8_t __pad0579[0xf]; // 0x579
public:
	CUtlVector<C_SceneEntity::QueuedEvents_t> m_QueuedEvents; // 0x588	
	float m_flCurrentTime; // 0x5a0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x40
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "CHandle< CFogController> m_hCtrl"
struct C_fogplayerparams_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkUserGroup "PlayerFogController"
	CHandle<C_FogController> m_hCtrl; // 0x8	
	float m_flTransitionTime; // 0xc	
	Color m_OldColor; // 0x10	
	float m_flOldStart; // 0x14	
	float m_flOldEnd; // 0x18	
	float m_flOldMaxDensity; // 0x1c	
	float m_flOldHDRColorScale; // 0x20	
	float m_flOldFarZ; // 0x24	
	Color m_NewColor; // 0x28	
	float m_flNewStart; // 0x2c	
	float m_flNewEnd; // 0x30	
	float m_flNewMaxDensity; // 0x34	
	float m_flNewHDRColorScale; // 0x38	
	float m_flNewFarZ; // 0x3c	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x15e8
// Has VTable
// 
// MNetworkExcludeByName "m_flexWeight"
// MNetworkExcludeByName "m_blinktoggle"
// MNetworkIncludeByName "m_nNextThinkTick"
// MNetworkExcludeByUserGroup "m_flPoseParameter"
// MNetworkExcludeByUserGroup "m_flCycle"
// MNetworkExcludeByUserGroup "overlay_vars"
// MNetworkUserGroupProxy "CBasePlayerWeapon"
// MNetworkVarNames "GameTick_t m_nNextPrimaryAttackTick"
// MNetworkVarNames "float32 m_flNextPrimaryAttackTickRatio"
// MNetworkVarNames "GameTick_t m_nNextSecondaryAttackTick"
